let словник = [
    "бібліотека",
    "кава",
    "подорож",
    "кіно",
    "музика"
];


let загаданеСлово = словник[Math.floor(Math.random() * словник.length)];

let результатГри = [];
for (let x = 0; x < загаданеСлово.length; x++) {
    результатГри[x] = "_";
}

let залишилосьСпроб = загаданеСлово.length;

while (залишилосьСпроб > 0) {
    alert(результатГри.join(" "));

    let введенаЛітера = prompt("Вгадайте літеру або натисніть 'Скасувати', щоб вийти з гри.");
    if (введенаЛітера === null) {
        break;
    } else if (введенаЛітера.length !== 1) {
        alert("Будь ласка, введіть лише одну літеру");
    } else {
        let літераВгадана = false;
        for (let y = 0; y < загаданеСлово.length; y++) {
            if (загаданеСлово[y] === введенаЛітера) {
                результатГри[y] = введенаЛітера;
                залишилосьСпроб--;
                літераВгадана = true;
            }
        }
        if (!літераВгадана) {
            alert("На жаль, ця літера не входить до слова.");
        }
    }
}

alert(результатГри.join(" "));
alert("Гра завершена! Загадане слово: " + загаданеСлово);
