var x = 6
var y = 14
var z =4 

x += y - x++ * z;
document.write(x +"<br/>");

/*
1)Спочатку вираховуємо значення x++ * z. 
  Постфіксний інкремент x++ збільшує значення x ,
  але в цьому виразі залишається 6. 
  Тоді x++ * z дорівнює 6 * 4 = 24.
2) y - x++ * z дорівнює 14 - 24 = -10.
3)Додаємо результат x += y - x++ * z означає, що x стає 6 + (-10) = -4.
*/

var x = 6
var y = 14
var z =4 

z = --x - y * 5 ;
document.write(z +"<br/>");

/*
1)Спочатку ми зменшуємо число x на одиницю. З x = 6 воно стає x = 5.
2)Тепер ми беремо число y і помножимо його на 5. y = 14 * 5 = 70.
3)від 5 віднімаємо 70. Це дає нам -65.
*/


var x = 6
var y = 14
var z =4 

y /= x + 5 % z; 
document.write(y +"<br/>");
/*
1)Спочатку рауєм вираз x + 5 % z.Тут 5 % 4 дорівнює 1.
 Таким чином, x + 5 % z дорівнює 6 + 1 = 7.
2)Ділимо значення y на результат попереднього кроку за допомогою /=. y /= x + 5 % z 
3)y стає 14 / 7 = 2.
*/

var x = 6
var y = 14
var z =4 

result = z - x++ + y * 5;
document.write(result +"<br/>");
/*
1)віднімаємо значення x від z. z - x++ дорівнює 4 - 6 = -2.
 x збільшується на 1, тобто стає 7.
2)множимо значення y на 5. y * 5 
дорівнює 14 * 5 = 70.
3)додаємо -2 до 70. 
result дорівнює 70 - 2 = 68.
*/

var x = 6
var y = 14
var z =4 

x = y - x++ * z;
document.write(x +"<br/>");
/*
1)рахуємо значення x++ * z. Постфіксний інкремент x++ тобто = 
x++ * z дорівнює 6 * 4 = 24.
2)віднімаємо результат  y - x++ * z 
дорівнює 14 - 24 = -10.
*/